{
    "file": "wire\/modules\/Fieldtype\/FieldtypeTextarea.module",
    "textdomain": "wire--modules--fieldtype--fieldtypetextarea-module",
    "translations": {
        "00f6c76a7a83b1d7aab61a93e513e9d5": {
            "text": "Tipo de Entrada de Campo"
        },
        "127852afa67b41673ab8ea17b383847c": {
            "text": "O tipo de campo que será utilizado para colectar entradas (Textarea é o valor por defeito). Note que se modificar isto e submeter, as opções de configuração disponíveis na secção da aba \"entrada\" podem mudar."
        },
        "2effa58f13159d138a634233e246713d": {
            "text": "Tipo de Conteúdo"
        },
        "88183b946cc5f0e8c96b2e66e1c74a7e": {
            "text": "Desconhecido"
        },
        "5d85f44b69f9d7e86c7f3f473f97f771": {
            "text": "="
        },
        "f0a7350231680497c534e592203a3b7b": {
            "text": "Markup\/HTML com gestão de imagens"
        },
        "6579c1fdbe94982347736ad47f0949cb": {
            "text": "A escolha Markup\/HTML (opcionalmente com gestão de imagem) é recomendada para os campos utilizando RTF (tinyMCE, CKEditor, etc.) e aqueles que contem HTML. Fornece filtragens de verificações de execução suplementares, para garantir a qualidade."
        },
        "f49044eb0f5ff823c157a2feedf2b9f8": {
            "text": "Para mais informações sobre as opções acima, ver [a descrição das opções de tipo de conteúdo](%s)."
        },
        "3e7a86573c428ffd2bf3145cea18514b": {
            "text": "Escolhe a opção \"Markup\/HTML com gestão de imagens\" para adicionar as verificações de execução seguintes:"
        },
        "2bc17a9602fb3fd33f9a6561c7b36177": {
            "text": "1. Preenche os atributos alt em branco com a descrição do ficheiro - assegura que as mudanças à descrição de ficheiro sejam reflectidas no atributo <img> alt ."
        },
        "5c84d65097148d9fa9a1be01e38c8f27": {
            "text": "2. Re-cria automaticamente as variações de tamanho das imagens que não existem."
        },
        "0899ba8ac053ddbc869eac2bf0c9f458": {
            "text": "3. Remove as etiquetas <img> que apontam para ficheiros que não existem."
        },
        "a171deaa8f82c6e29796e95126fbd644": {
            "text": "4. Grava os erros de falta de imagens no ficheiro de registo \"markup-qa-errors\" e envia uma notificação ao utilizador de sistema\/administração"
        }
    }
}