{
    "file": "wire\/modules\/Inputfield\/InputfieldPage\/InputfieldPage.module",
    "textdomain": "wire--modules--inputfield--inputfieldpage--inputfieldpage-module",
    "translations": {
        "4349c31cba02549f2043d69b9eb0d66e": {
            "text": "(não publicado)"
        },
        "6dc3e540b29f68e1eaf558b6a2edd476": {
            "text": "Introduzir os títulos dos elementos que quer adicionar, um por linha. Serão criados e adicionados a sua selecção quando guardar a página."
        },
        "b82b34c94588fc88ca4a6b18f5e18aef": {
            "text": "Introduzir o título do elemento que quer adicionar. Se tornará seleccionado quando guardar a página."
        },
        "e3cada644043c81e6ff21250f2e53f3a": {
            "text": "Novas páginas serão adicionadas a %s"
        },
        "49e5878c7a1901b0a9baae9e0c774150": {
            "text": "Criar Nova"
        },
        "f0670991d41b78617ca7810b7ce334b9": {
            "text": "Página %s adicionada"
        },
        "29b43e0c70cb336d03f04f3f06a8789d": {
            "text": "Erro a adicionar a página \"%s\""
        },
        "81eeab9506186e2dca8faefa78d54067": {
            "text": "Exemplo:"
        },
        "6f8d1b93e4aad53511c85e29ed36b3d0": {
            "text": "(por defeito)"
        },
        "962f1366aaa6f1c636d3214e12322362": {
            "text": "Páginas Seleccionáveis"
        },
        "21348aafc8733099a5b3c20e4a90e7b4": {
            "text": "Parentes da(s) página(s) seleccionável"
        },
        "5b0591013bf2cac5ee96f90e31a5b2e9": {
            "text": "Seleciionar os parentes das páginas que estão seleccionáveis."
        },
        "dceea0994df5640514b906a18a43810f": {
            "text": "Modelo da(s) página(s) seleccionável"
        },
        "9f80067ff42d8e69d0c3a24b67ef4c85": {
            "text": "Seleccionar o modelo das páginas seleccionáveis. Pode utilizar no lugar ou em acréscimo, o parente superior. NOTA: não compatível com os campos com tipo de entrada PageListSelect."
        },
        "53158583a607fba6e71f0f18d73a910b": {
            "text": "Selector personalizado para encontrar páginas seleccionáveis"
        },
        "6ad160329dd81f9ecede290bffe93928": {
            "text": "Se pretende encontrar páginas seleccionáveis utilizando o selector de Processwire em vez de seleccionar uma página parente ou um modelo (acima), então introduza o selector para encontrar as páginas seleccionáveis. Este selector será passado para uma instrução $pages->find(\"seu selector\"). NOTA: não está actualmente compatível com os campos de entrada do tipo PageListSelect."
        },
        "3d9e8a4318894ce247ba920c7961d5da": {
            "text": "Enquanto que isto substitui as selecções de parentes ou modelo acima, estas selecções continuam a ser utilizadas para validação (retire a selecção se não quer este comportamento)."
        },
        "1920ec4f46fd3f4962d351c84f69cf7e": {
            "text": "parent=\/produtos\/, template=produto, sort=nome"
        },
        "d04c6c77608855a3ff0fb3ee32a2cd53": {
            "text": "Código PHP personalizado para encontrar páginas seleccionáveis"
        },
        "d0188d35124b9f7887cc0d158da64328": {
            "text": "Se pretende encontrar páginas seleccionáveis utilizando um fragmento de código PHP em vez de seleccionar uma página parente ou um modelo (acima), então introduza o selector para encontrar as páginas seleccionáveis. Este código tem acesso às variáveis API de $page e $pages, onde $page refere-se à página sendo editada."
        },
        "a9e792488572b1b5316720df20682ad3": {
            "text": "NOTA: não é compativel com os campos de entrada dos tipos PageListSelect ou Autocomplete."
        },
        "e8764466585c7e1a106fd67e89ce91c6": {
            "text": "O fragmento de código deve devolver ou um PageArray, um Page ou um NULL. Se devolver um Page, os filhos da página são utilizados como páginas seleccionáveis. Este uso é opcional, e se for utilizado, substitui os campos de parentes\/modelos\/selector acima."
        },
        "b329c0bc717cd35d04a9362fc0d778c2": {
            "text": "return $page->parent->parent->children(\"nome=locais\")->first()->children();"
        },
        "d8f9928df4675d892629c754932fad80": {
            "text": "Campo de etiqueta"
        },
        "e5c1791ec6a73eed5d8a7002e2799470": {
            "text": "Selecionar o campo da página que quer utilizar para gerar as etiquetas de cada página seleccionável."
        },
        "a0cb77306b6f4e96a00cdc5a0c128166": {
            "text": "Seleccionar \"Formato Personalizado\" se pretende specificar vários campos, ou outros campos que não aparecem acima."
        },
        "282acaaa24f42bb779ccb235bfc37491": {
            "text": "Formato personalizado (vários campos)'.'..."
        },
        "ccfbd07eab619923148d98d09c91e15e": {
            "text": "Formato personalizado da etiqueta de página"
        },
        "ebebc537c9c3117a5e2304be412d83f3": {
            "text": "Especificar um ou mais nomes de campos rodeado de {chavetas} juntamente com outros carácteres, espaços ou puntuações."
        },
        "190dcbcb68a0545eb0e38c4eca2961e0": {
            "text": "Exemplo: {parent.titulo} - {titulo}, {data}"
        },
        "881b1a7b97bc4d70099cc59a53e8a8e5": {
            "text": "Tipo de campo de entrada"
        },
        "bcf331523fb730639bde7c2e8fc4f811": {
            "text": "O tipo de campo que será utilizado para seleccionar uma página. Seleccionar um que seja consistente com a escolha Página única vs. Várias Páginas feita na aba \"detalhes\" do campo."
        },
        "ebd9ef41cdc1369f55f58b151390de31": {
            "text": "Alguns tipos de entrada podem apresentar opções suplementares de configuração. Depois de seleccionar um tipo de campo de entrada e guardar as modificações, as opções suplementares de configuração irão aparecer na secção abaixo."
        },
        "195a66e99428447940ac989366724b42": {
            "text": "Tipos sinalizados com um astérisco são para a selecção de várias páginas."
        },
        "54b79da80ed98094797b9e3ee68488a6": {
            "text": "Tipos sinalizados com um mais assumem um \"parente\" como sendo a raiz da árvore, em vez de um parente directo."
        },
        "8332fcbd80839cdcc617bee49529ad1e": {
            "text": "Permitir a criação de novas páginas dentro do campo?"
        },
        "20463a1675fc256b438538124524746a": {
            "text": "Se marcado, uma opção para adicionar novas página(s) será apresentada, se os requisitos indicados estão reúnidos."
        },
        "7673446b991c59998763308c9f7f5d53": {
            "text": "1. E um parente e um modelo devem ser seleccionados acima."
        },
        "65a208c6491dac4a6fb17f7a62f76658": {
            "text": "2. O utilizado editor deve ter o acesso para criar\/publicar essas páginas."
        },
        "aa2e4d260721b3a7e2776b8cb9c19fdf": {
            "text": "3. A etiqueta de campo deve ser \"title (default)\"."
        },
        "d9a5927aa49f1a766a15e692b69c1c91": {
            "text": "Modulos de campo de entrada dispóniveis para a selecção de página"
        },
        "d5a1e1e864827e2bbb99d144e30359de": {
            "text": "Seleccionar os módulos de campo de entrada que podem ser utilizados para a selecção de página. Estes são geralmente campos de entradas que permitem a selecção de uma ou várias opções."
        }
    }
}