{
    "file": "wire\/modules\/Process\/ProcessForgotPassword.module",
    "textdomain": "wire--modules--process--processforgotpassword-module",
    "translations": {
        "6072e83b7f35887c76e64920bd370f4a": {
            "text": "Redefinir Senha"
        },
        "b49caf114ce87eeb21267f29e9a62420": {
            "text": "Impossível completar a redefinição da senha. Verifique se se encontra no mesmo computador e no mesmo navegador em que foi submetido originalmente o pedido."
        },
        "dcfc149491f06edb3e6942510b6fc339": {
            "text": "Se tiver uma conta no nosso sistema com uma morada de email válido, depois de submeter este formulário ser-lhe-á enviada uma mensagem de email com a ligação onde poderá clicar para redefinir a sua senha."
        },
        "edcc4a7ecb7854d0ea84fff05b5eeb3e": {
            "text": "Assumindo que a informação referente à sua conta foi encontrada, e que esta inclui uma morada de email, foi-lhe enviada uma mensagem com a informação necessária para redefinir a sua password."
        },
        "43da6233b07fcc59791c3f91861ab7b5": {
            "text": "Por favor verifique a sua caixa de email. Se ainda não tiver recebido uma mensagem dentro de 15 minutos, por favor contacte o administrador do site para redefinir a sua senha. Este pedido de redefinição irá expirar em 60 minutos. Não feche esta janela até ter completado o seu pedido de redefinição da senha."
        },
        "333b348fd95607678f8a9a333cc7b7b4": {
            "text": "Informação de redefinição da senha"
        },
        "6d14491a1718796766f2775f857af701": {
            "text": "Para completar a redefinição da sua senha, clique no seguinte URL (ou copie-o para o seu navegador) e siga as instuções:"
        },
        "3299941fe3475a594847754b9e91f3b7": {
            "text": "Pedido de redefinição da senha inválido. O tempo para este pedido poderá ter expirado."
        },
        "a0bfb8e59e6c13fc8d990781f77694fe": {
            "text": "continuar"
        },
        "f469dd0000597b66060ea51c52eacf58": {
            "text": "A sua senha foi redefinida com sucesso. Pode iniciar sessão."
        },
        "168b9e356db803204c123e0445ef83f4": {
            "text": "A redefinição da senha não é permitida"
        },
        "9ec54ec336b65da6179cf750de33ecd7": {
            "text": "Senha Esquecida"
        },
        "e241608b636b6cdde53b70cb2ade0daf": {
            "text": "Fornece a possibilidade de redefinir uma senha\/email para o processo de iniciação de sessão."
        },
        "5b69044da7774b93059c878056e1c28a": {
            "text": "Entre Seu Nome de Usuário"
        },
        "201096f37f6c6d8504b8d29778854bb5": {
            "text": "Esqueceu o Seu Nome de Usuário"
        },
        "abb2644b2def6033e18a82971e1c179a": {
            "text": "Informe o seu endereço de email e lhe enviaremos o seu nome de conta."
        },
        "9d7356832e30137fa56cc06f823a8de6": {
            "text": "Por razões de segurança, não revelamos se uma conta existe neste ecrã."
        },
        "6647aaa5aa21f02ecdb174cdea5ae9f7": {
            "text": "Informações da Conta"
        },
        "350908378ec41ef0131289d5f5fc28b6": {
            "text": "Está a receber este email porque pediu por seu nome de conta."
        },
        "d1a638c6049308ede5367d21be8cb2dd": {
            "text": "O seu endereço de email parece estar associado com várias contas e não podemos revelar estas por razões de segurança. Faz favor contactar o administrador para ter apoio."
        },
        "dfe88c81efe0f54d4bf8444498b60f57": {
            "text": "O seu nome de conta é:"
        },
        "486d7b5670a666148f3fef85bc3ae900": {
            "text": "Esta ligação expira 60 minutos depois de ser enviada. Este URL deve ser aberto a partir do mesmo computador e do mesmo navegador com os quais foi pedido."
        },
        "b005fe2d6e74b5c6108864e9abb089af": {
            "text": "Endereço de email para enviar mensagens"
        }
    }
}