{
    "file": "wire\/modules\/Process\/ProcessRole\/ProcessRole.module",
    "textdomain": "wire--modules--process--processrole--processrole-module",
    "translations": {
        "d08ccf52b4cdd08e41cfb99ec42e0b29": {
            "text": "Permissões"
        },
        "e0c8b59640bc35bac606431203d2d9b0": {
            "text": "Para descrições detalhadas destas permissões, por favor ver [a referência das permissões] (%s)."
        },
        "ae9a363b2dfa9181da7ffde8e37813b5": {
            "text": "rasurado"
        },
        "cea791d6258d032e4742a9a99f1ecf11": {
            "text": "Marcar aqui a permissão page-edit não atribui um acesso de edição a qualquer página por si só. Em vez disso, permite-lhe configurar o acesso de edição para este perfil nas definições de acesso do modelo. A permissão page-edit é também o que permite aos utilizadores de ver as páginas na administração. Esta permissão é recomendada para todos os utilizadores administradores."
        },
        "d923671ad010412a573db8ccdbddc911": {
            "text": "Indica que uma permissão pode opcionalmente ser adicionada ou revogada de um perfil de utilizador nas definições de acesso do modelo.Marcar a permissão disponibiliza-a para todos os modelos editáveis. Se pretende só ter um perfil de utilizador com uma destas permissões para as páginas utilizando um modelo especifico, deveria deixar-la desmarcada aqui e em vez disso, seleccionar-la na aba \"Acesso\" de um modelo."
        },
        "64a4d3473343a325080c311b47099be6": {
            "text": "As permissões page -add e page-create podem ser adicionadas só a partir das definições de acesso do modelo, e são mostradas aqui só para informação."
        },
        "efc30c4ed12a9e95e4fad5ae9be115fb": {
            "text": "Indica um modelo que adiciona a permissão. Clicar para abrir uma janela com as definições de acesso para este modelo. Se o nome do modelo tem %s, indica que a permissão está adicionada ao modelo, mas está sendo substituída pela sua selecção aqui."
        },
        "dce4a957c0c6225be564be146d71b245": {
            "text": "O mesmo que em cima excepto que a permissão está sendo revogada pelo modelo (em vez de adicionado)."
        },
        "c6cc7e92b9fc348360b34c024086432c": {
            "text": "nome|descrição"
        },
        "dc3abfaff3190368a09f01d6589eeeea": {
            "text": "Adicionar subpáginas às páginas utilizando o modelo"
        },
        "9c281188158fc34cf5afc9d2820a761c": {
            "text": "Criar páginas utilizando o modelo"
        },
        "faa5826bce6656df7f63cbeb5b2a85fe": {
            "text": "Esta permissão pode ser atribuída só com as definições de acesso do modelo."
        },
        "9bfb6e6af6e6793bfa9387e728187c87": {
            "text": "(exigido)"
        },
        "3cac60e98937c01a72ef6e6cfe66f90f": {
            "text": "Esta permissão é exigida para todos os perfis."
        },
        "1def073965e264ae40ae1d9877290fd3": {
            "text": "aplica-se a todos os modelos editáveis"
        },
        "26c77f67debae46ee5b0a12626817076": {
            "text": "%1$s adicionada pelo modelo %2$s, clique para editar"
        },
        "37ef521112472af77d381e834922a7af": {
            "text": "%1$s revogada pelo modelo %2$s, clique para editar"
        },
        "1754bfdd544e98486c2ed46753ca8edd": {
            "text": "Marcar a caixa adiciona a permissão a todos os modelos editáveis, mas esta permissão já está aplicada em separado por um ou mais modelos. Para manter as coisas organizadas, sugerimos remover a permissão destes modelos antes de activa-la para todos. Tem a certeza que quer activa-la agora?"
        },
        "95c58584c58685c05c1a7cc706416455": {
            "text": "actualmente não aplicado a qualquer modelo"
        },
        "a5cd3ed116608dac017f14c046ea56bf": {
            "text": "Perfis"
        },
        "e5e77ccf470959bc6be60127730908b5": {
            "text": "Gere os perfis de utilizador e quais as permissões atribuídas a estes"
        }
    }
}